vtd214/STM32_OMMI/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2026 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f4xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define R_L_EN_M1_Pin GPIO_PIN_13
#define R_L_EN_M1_GPIO_Port GPIOC
#define R_L_EN_M2_Pin GPIO_PIN_14
#define R_L_EN_M2_GPIO_Port GPIOC
#define R_L_EN_M3_Pin GPIO_PIN_15
#define R_L_EN_M3_GPIO_Port GPIOC
#define Encoder_C1_M4_Pin GPIO_PIN_0
#define Encoder_C1_M4_GPIO_Port GPIOA
#define Encoder_C2_M4_Pin GPIO_PIN_1
#define Encoder_C2_M4_GPIO_Port GPIOA
#define LPWM_M3_Pin GPIO_PIN_2
#define LPWM_M3_GPIO_Port GPIOA
#define RPWM_M3_Pin GPIO_PIN_3
#define RPWM_M3_GPIO_Port GPIOA
#define R_L_EN_M4_Pin GPIO_PIN_12
#define R_L_EN_M4_GPIO_Port GPIOB
#define LPWM_M1_Pin GPIO_PIN_8
#define LPWM_M1_GPIO_Port GPIOA
#define RPWM_M1_Pin GPIO_PIN_9
#define RPWM_M1_GPIO_Port GPIOA
#define LPWM_M2_Pin GPIO_PIN_10
#define LPWM_M2_GPIO_Port GPIOA
#define RPWM_M2_Pin GPIO_PIN_11
#define RPWM_M2_GPIO_Port GPIOA
#define Encoder_C1_M1_Pin GPIO_PIN_15
#define Encoder_C1_M1_GPIO_Port GPIOA
#define Encoder_C2_M1_Pin GPIO_PIN_3
#define Encoder_C2_M1_GPIO_Port GPIOB
#define Encoder_C1_M2_Pin GPIO_PIN_4
#define Encoder_C1_M2_GPIO_Port GPIOB
#define Encoder_C2_M2_Pin GPIO_PIN_5
#define Encoder_C2_M2_GPIO_Port GPIOB
#define Encoder_C1_M3_Pin GPIO_PIN_6
#define Encoder_C1_M3_GPIO_Port GPIOB
#define Encoder_C2_M3_Pin GPIO_PIN_7
#define Encoder_C2_M3_GPIO_Port GPIOB
#define LPWM_M4_Pin GPIO_PIN_8
#define LPWM_M4_GPIO_Port GPIOB
#define RPWM_M4_Pin GPIO_PIN_9
#define RPWM_M4_GPIO_Port GPIOB

/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
